## Exercício - Titanic
disponível em https://www.kaggle.com/c/titanic/overview

#### Descrição
O naufrágio do RMS Titanic é um dos naufrágios mais famosos da história. Em 15 de abril de 1912, durante sua viagem inaugural, o Titanic afundou após colidir com um iceberg, matando 1502 de 2224 passageiros e tripulantes. Essa tragédia chocou a comunidade internacional e levou a melhores regulamentações de segurança para os navios.

Uma das razões pelas quais o naufrágio levou a tal perda de vidas foi que não havia botes salva-vidas suficientes para os passageiros e a tripulação. Embora houvesse algum elemento de sorte envolvido na sobrevivência do naufrágio, alguns grupos de pessoas eram mais propensos a sobreviver do que outros, como mulheres, crianças e a classe alta.

Nesse desafio, a atividade é que você conclua a análise de que tipo de pessoa provavelmente sobreviverá. Em particular, solicitamos você deve aplicar classificadores de árvores de decisão para esta atividade.

### Descrição do dataset
Os dados foram divididos em dois grupos:

conjunto de treinamento (train.csv)
conjunto de teste (test.csv)
O conjunto de treinamento deve ser usado para criar seus modelos de aprendizado de máquina. Para o conjunto de treinamento, fornecemos o resultado (também conhecido como "verdade do solo") para cada passageiro. Seu modelo será baseado em "atributos", como sexo e classe dos passageiros. Você também pode usar a engenharia de atributos para criar novos atributos.

Parte do conjunto de treino deve ser usado para ver o desempenho do seu modelo em dados não vistos. 

Para o conjunto de testes, não é fornecido o rótulo de classe para cada passageiro. É seu trabalho prever esses resultados. Para cada passageiro no conjunto de testes, use o modelo que você treinou para prever se eles sobreviveram ou não ao naufrágio do Titanic. O resultado deve ser submetido na plataforma Kaggle (opção **submit predictions**) a fim de calcular a acurácia. 

Também incluímos gender_submission.csv, um conjunto de previsões que supõem que todas e apenas passageiras sobrevivem, como um exemplo da aparência de um arquivo de envio.

### Dicionário de Dados

**Variable -	Definition	- Key**

survival - Survival	- 0 = No, 1 = Yes

pclass -	Ticket class -	1 = 1st, 2 = 2nd, 3 = 3rd

sex -	Sex	

Age	- Age in years	

sibsp -	# of siblings / spouses aboard the Titanic	

parch- # of parents / children aboard the Titanic	

ticket - Ticket number	

fare - Passenger fare	

cabin- Cabin number	

embarked- Port of Embarkation	C = Cherbourg, Q = Queenstown, S = Southampton

In [3]:
import numpy as np
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score

In [4]:
# Carregando o conjunto de dados de treinamento

train_data = pd.read_csv("train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# Carregando o conjunto de dados de teste
test_data = pd.read_csv("test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
# Media dos valores de sobreviventes para mulheres
women = train_data.loc[train_data.Sex == 'female']["Survived"]
rate_women = sum(women)/len(women)

print("% mulheres sobreviventes:", rate_women)

% mulheres sobreviventes: 0.7420382165605095

In [7]:
# Media dos valores de sobreviventes para homens
men = train_data.loc[train_data.Sex == 'male']['Survived']
rate_men = sum(men)/len(men)

print("% homens sobreviventes:", rate_men)

% homens sobreviventes: 0.18890814558058924

In [8]:
def clean(df):
    df.drop(['Cabin','Name','Ticket','Embarked','Fare'],axis=1,inplace=True)
    df.Age=df.Age.fillna(df.Age.median())
    df.dropna()
    return df

In [9]:
clean(train_data)
clean(test_data)

     PassengerId  Pclass     Sex   Age  SibSp  Parch
0            892       3    male  34.5      0      0
1            893       3  female  47.0      1      0
2            894       2    male  62.0      0      0
3            895       3    male  27.0      0      0
4            896       3  female  22.0      1      1
..           ...     ...     ...   ...    ...    ...
413         1305       3    male  27.0      0      0
414         1306       1  female  39.0      0      0
415         1307       3    male  38.5      0      0
416         1308       3    male  27.0      0      0
417         1309       3    male  27.0      1      1

[418 rows x 6 columns]

In [10]:
# processando os dados
train_data.Sex=pd.get_dummies(train_data.Sex,drop_first=True)
test_data.Sex=pd.get_dummies(train_data.Sex,drop_first=True)

test_data.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch
0          892       3    1  34.5      0      0
1          893       3    0  47.0      1      0
2          894       2    0  62.0      0      0
3          895       3    0  27.0      0      0
4          896       3    1  22.0      1      1

In [11]:
# criando modelo

accuracies=[]

x=train_data.drop(['Survived'],axis=1)
y=train_data['Survived']

x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=.2)

In [12]:
# def modelo
def model(model_name):
    model_name.fit(x_train,y_train)
    pre=model_name.predict(x_test)
    accuracy=accuracy_score(pre,y_test)
    print('Accuracy : ',accuracy)
    accuracies.append(accuracy)

In [13]:
Algorithm=['GradientBoostingClassifier']

model_name= GradientBoostingClassifier()
model(model_name)

Accuracy :  0.7877094972067039

In [14]:
# Gerando arquivo para submissão no Kaggle
best_model=GradientBoostingClassifier()
best_model.fit(x_train,y_train)
GradientBoostingClassifier()
pre=best_model.predict(test_data) 
final=test_data.PassengerId  
df=pd.DataFrame({'PassengerId':final,'Survived':pre}) 
df.to_csv('submission2.csv',index=False)

# Score: 0.65311